RodrigoCalgaro/sentis/sdkconfig.defaults
# =============================================================================
# sdkconfig.defaults — configuración base del proyecto SENTIS
#
# Este archivo define los valores por defecto del proyecto que DEBEN ser
# distintos del default de ESP-IDF. Se aplica automáticamente la primera vez
# que se compila en un equipo nuevo (cuando no existe sdkconfig), evitando
# la necesidad de ejecutar idf.py menuconfig manualmente.
#
# IMPORTANTE: sdkconfig (generado por el build system) NO debe versionarse en
# git porque es específico del equipo y se regenera desde este archivo.
# sdkconfig.defaults SÍ debe estar en git — es la fuente de verdad del proyecto.
#
# Para aplicar cambios en un equipo que ya tiene sdkconfig:
#   idf.py set-target esp32p4   (regenera sdkconfig desde defaults)
# =============================================================================

# -----------------------------------------------------------------------------
# Target — ESP32-P4
# -----------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"

# -----------------------------------------------------------------------------
# Revisión de chip — ESP32-P4 v1.x
#
# El ESP32-P4 existe en dos generaciones con diferencias de hardware muy
# grandes: v0.x/v1.x y v3.x. Son mutuamente excluyentes en el build.
# El chip de esta placa es v1.3, por lo que se activa SELECTS_REV_LESS_V3
# para compilar el bootloader y los drivers para la generación v1.x.
#
# SIN este flag el bootloader falla al flashear con:
#   "requires chip revision in range [v3.1 - v3.99] (this chip is revision v1.3)"
# -----------------------------------------------------------------------------
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# -----------------------------------------------------------------------------
# Frecuencia de CPU — ESP32-P4 v1.x
#
# En v1.x el CPLL corre a 360 MHz (no 400 MHz como en v3.x).
# Las frecuencias válidas con SELECTS_REV_LESS_V3 son: 90, 180, 360 MHz.
# Con 400 MHz el assert en esp_clk_init (clk.c:104) falla porque
# rtc_clk_cpu_freq_mhz_to_config() devuelve false para esa frecuencia.
# -----------------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# -----------------------------------------------------------------------------
# PSRAM (Phase 5 — cámara OV5647)
#
# El frame buffer de la cámara ocupa 800×640 = 512 KB en formato RAW8.
# Este tamaño no entra en la SRAM interna del ESP32-P4 junto con el resto del
# firmware, por lo que se requiere PSRAM externa.
#
# La placa de desarrollo ESP32-P4 incluye 32 MB de PSRAM en modo Hex (16 líneas),
# que es el único modo disponible en este chip.
# Velocidad 200 MHz es el default y el valor óptimo para P4.
# -----------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# -----------------------------------------------------------------------------
# Sensor de cámara OV5647 (Phase 5 — MIPI CSI-2)
#
# CONFIG_CAMERA_OV5647 habilita el driver del sensor en el componente
# espressif/esp_cam_sensor. Sin este flag, el compilador no agrega el directorio
# sensors/ov5647/include al path y ov5647.h no puede incluirse.
#
# Formato seleccionado: RAW8 800×640 @50fps — el de menor resolución disponible
# en modo MIPI, suficiente para la heurística de detección de posición.
#
# AUTO_DETECT: el sensor se detecta automáticamente al arranque vía I2C sin
# necesidad de llamar a ov5647_detect() manualmente (linker incluye el símbolo).
# Igual llamamos a ov5647_detect() explícitamente en vision.c para obtener el
# handle del sensor y controlar el formato — esta opción no genera conflicto.
#
# CSI_LINESYNC: sincronización de líneas MIPI (recomendado mantener activo).
# -----------------------------------------------------------------------------
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5647_CSI_LINESYNC_ENABLE=y

# -----------------------------------------------------------------------------
# Deshabilitar controlador SPI de cámara
#
# CAM_CTRL_SPI_ENABLE tiene default=y porque el ESP32-P4 soporta GPSPI.
# Sin embargo, el OV5647 usa MIPI CSI-2, no SPI. El código vendorizado de
# spi_slave.c en espressif/esp_cam_sensor v1.7.0 usa APIs internas de SPI
# (spicommon_dma_chan_alloc, spicommon_bus_initialize_io) que cambiaron en
# IDF v6.0.1, causando errores de compilación. Deshabilitamos esta opción
# ya que no necesitamos el controlador SPI para ningún sensor del proyecto.
# -----------------------------------------------------------------------------
CONFIG_CAM_CTRL_SPI_ENABLE=n

# -----------------------------------------------------------------------------
# Monitor USB CDC (solo desarrollo)
#
# Transmite frames JPEG de la cámara por el puerto USB OTG del ESP32-P4.
# Ver tools/monitor_viewer.py para el visualizador en el PC.
# DESHABILITADO por defecto: comparte UART0 con el console de IDF, lo que
# mezcla datos binarios JPEG con los logs de texto. Habilitar solo cuando
# se necesite el visualizador: idf.py menuconfig → SENTIS Monitor → Enable.
# -----------------------------------------------------------------------------
CONFIG_MONITOR_ENABLED=n
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

# -----------------------------------------------------------------------------
# Flash size — ESP32-P4-Module-DEV-KIT v1.3
#
# El módulo tiene 16 MB de flash. El IDF por defecto genera 2 MB (configuración
# conservadora); hay que sobreescribirlo explícitamente aquí.
# Sin este override, la partición "model" (ESP-SR, 5 MB) no entra en la imagen.
#
# Si el sdkconfig existente ya dice 2MB, borrar sdkconfig y reconstruir:
#   del sdkconfig && idf.py set-target esp32p4
# -----------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# -----------------------------------------------------------------------------
# Tabla de particiones personalizada — partitions.csv
#
# Incluye partición "model" de 5 MB para los modelos de espressif/esp-sr.
# Sin esta partición, esp_srmodel_init("model") devuelve NULL en boot.
# -----------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# -----------------------------------------------------------------------------
# ESP-SR — modelos de reconocimiento de voz
#
# MODEL_IN_FLASH: los modelos viven en la partición "model" (partitions.csv).
# SR_MN_EN_MULTINET6_QUANT: MultiNet6 inglés cuantizado (~3.5 MB en flash).
#   Alternativa más compacta si ajusta mejor: SR_MN_EN_MULTINET5_SINGLE_RECOGNITION_QUANT8 (~2.5 MB).
# SR_WN_WN9_HIESP: wake word "Hi ESP!" (opcional, habilita activación por voz).
#   Cambiar a SR_WN_WN9_HILEXIN para usar "Hi Lexin" como wake word.
#
# Después de cambiar estos valores regenerar sdkconfig y reflaschear:
#   del sdkconfig && idf.py set-target esp32p4 && idf.py flash
# -----------------------------------------------------------------------------
CONFIG_MODEL_IN_SDCARD=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y

# -----------------------------------------------------------------------------
# pp_ocr_v6 — modelos de OCR (Fase 7)
#
# Igual que ESP-SR y eSpeak-NG: modelos en la SD, no en flash. El default del
# propio componente es MODEL_IN_FLASH_RODATA (hornea el .espdl en el binario),
# lo cambiamos explícitamente a SD.
#
# Directorio en la SD: CONFIG_PP_OCR_V6_MODEL_SDCARD_DIR default = "models/p4"
# (relativo al mount point) — se deja el default porque coincide exactamente
# con la carpeta que trae el propio paquete (models/p4/*.espdl), así el
# provisioning es una copia directa sin renombrar nada. Ver sdcard_files/README.md.
# -----------------------------------------------------------------------------
CONFIG_PP_OCR_V6_MODEL_IN_SDCARD=y

# -----------------------------------------------------------------------------
# Optimización de compilador — necesaria para inferencia pp_ocr_v6 (Fase 7)
#
# El proyecto venía con el default de ESP-IDF (Debug, -Og). La inferencia de
# esp-dl envuelve sus kernels de conv2d/reduce en wrappers std::function/lambda
# (dl_base.hpp, dl_module_reduce_base.hpp) que en -Og NO se inlinean, sumando
# overhead real por cada llamada indirecta multiplicado por cientos de miles
# de píxeles/canales — suficiente para que una sola pasada del detector supere
# los 5s del task watchdog y dispare "task_wdt" en el IDLE del core que corre
# la tarea de OCR (esta nunca cede CPU durante la inferencia).
#
# CONFIG_COMPILER_OPTIMIZATION_PERF es exactamente lo que usa el ejemplo
# oficial de Espressif (esp-dl examples/pp_ocr_v6/sdkconfig.defaults.esp32p4).
# -----------------------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# -----------------------------------------------------------------------------
# Task watchdog — margen extra para inferencia OCR (Fase 7)
#
# Medido en hardware (2026-08-10, build PERF): una sola pasada del detector
# pp_ocr_v6 sobre el frame 400x320 tarda ~15-18s en este chip — 15s quedaba
# justo en el límite y disparaba "task_wdt" una vez por ciclo (no fatal,
# CONFIG_ESP_TASK_WDT_PANIC está off, pero es ruido). 25s da margen real.
# Una tarea genuinamente trabada seguiría disparando el watchdog igual, solo
# que con más margen antes de considerarla colgada.
# -----------------------------------------------------------------------------
CONFIG_ESP_TASK_WDT_TIMEOUT_S=25

# -----------------------------------------------------------------------------
# Main task stack
#
# El default de ESP-IDF es 3584 bytes.  eSpeak-NG (TranslateClause +
# MakePhonemeList) necesita >39 KB de stack, pero tts_speak() crea una tarea
# temporal de 64 KB solo durante la síntesis y la destruye al terminar.
# 16 KB es suficiente para app_main() con todas las llamadas de init.
# -----------------------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# -----------------------------------------------------------------------------
# WiFi via ESP32-C6 (esp_hosted) — link a la app Android compañera
#
# El ESP32-P4 no tiene radio propia. El WiFi corre sobre el co-procesador
# ESP32-C6 a bordo, conectado por SDIO, vía espressif/esp_hosted. Una vez
# configurado, la app usa esp_wifi.h estándar sin cambios (ver
# components/wifi/wifi.c) — esp_hosted actúa como transporte transparente.
#
# Slot SDIO: la SD (storage) ya ocupa el slot 0 con pines IOMUX fijos
# (CMD=44, CLK=43, D0-D3=39-42, ver board_config.h) — coincide exactamente
# con lo que exige ese slot en el ESP32-P4, así que esp_hosted DEBE ir en
# el slot 1 (default de la librería, no hace falta fijarlo a mano).
#
# CONFLICTO DE HARDWARE — CONFIRMADO EN HARDWARE REAL (2026-09-16):
# el pin de reset del C6 que usa esp_hosted por default en ESP32-P4 es
# GPIO54 — el MISMO pin que usa la cámara OV5647 para XCLK (ver
# board_config.h). Se intentó primero deshabilitar el reset por GPIO
# (-1, valor permitido por el rango del Kconfig), pero el driver real
# (eh_host_bus_sdio.c:1982, ensure_slave_bus_ready) hace
# `assert(reset_pin.pin != -1)` INCONDICIONAL — no hay forma de arrancar
# sin un pin de reset real, sin importar la estrategia configurada.
# Confirmado con el log de boot real: crash-reboot loop con
# "assert failed: ensure_slave_bus_ready eh_host_bus_sdio.c:1982".
#
# Se usa GPIO54 (el pin físico real, según pines confirmados en hardware:
# CLK=18 CMD=19 D0-D3=14-17, iguales a un BSP de terceros para esta misma
# placa). Mitigación: `ensure_slave_bus_ready()` pulsa el reset UNA sola vez
# durante `wifi_init()` (no lo mantiene ocupado después) — en
# main/sentis.c, wifi_init() corre bien antes que vision_init(), así que la
# cámara configura GPIO54 recién después de que el pulso de reset terminó.
# PENDIENTE DE CONFIRMAR EN HARDWARE: que la cámara siga funcionando bien
# tras este cambio de orden — si el frame de cámara sale corrupto o no
# arranca, este es el primer sospechoso.
# -----------------------------------------------------------------------------
CONFIG_ESP_HOSTED=y
CONFIG_ESP_HOSTED_HOST_TYPE_MCU=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y

CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54

# Confirmado en hardware (2026-09-18): el bring-up a veces no completa el
# handshake SDIO con el C6, y cuando eso pasa el controlador SDMMC queda
# ocupado/sin liberar, tumbando también el montaje de la SD (storage_init
# falla con "no available sd host controller" en el mismo boot).
#
# Primer intento (insuficiente): subir CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_TIMEOUT_MS
# de 5000 a 15000ms + reintento automático — NO alcanzó, el fallo cambió de
# forma (dejó de aparecer "bring-up timed out") pero se sigue colgando en el
# handshake de mas arriba (eh_init_evt), ahora en ~5.6s.
#
# Causa real sospechada: reconectar idf.py monitor resetea el P4 (via RTS)
# pero NO al C6 (tiene alimentación propia) — el P4 arranca de cero contra
# un C6 que sigue corriendo con estado viejo de la sesión anterior. Con
# estrategia "solo si es necesario" el chequeo inicial de bus pasa igual
# (el C6 sigue respondiendo a nivel físico SDIO), así que nunca se llega a
# pulsar el reset real, y se cuelga en el handshake de protocolo (que no
# depende de BRINGUP_TIMEOUT_MS). Fix: resetear el C6 SIEMPRE al arrancar
# el P4, no solo cuando falla — mantiene a ambos sincronizados en cada boot.
# DIAGNOSTICO TEMPORAL (2026-09-18): volver a ONLY_IF_NECESSARY para probar
# si el pulso de reset en si (no el estado del pin despues) es la causa de
# que la camara deje de entregar frames con RESET_STRATEGY_ALWAYS. Si esto
# arregla la camara, confirma la hipotesis pero reintroduce el WiFi flaky
# entre boots via monitor (el C6 no se resetea solo al reconectar el
# monitor — ver memoria del proyecto). Revertir a ALWAYS si no cambia nada.
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ONLY_IF_NECESSARY=y
CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_TIMEOUT_MS=15000
CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_ON_TIMEOUT_REATTEMPT=y

# EXPERIMENTO CERRADO (2026-09-21): choice ESP_HOSTED_HOST_SDIO_RX_OPT
# agotado por completo, las 3 opciones probadas/analizadas:
#   - RX_STREAMING_MODE (default, esta linea comentada abajo): camara
#     rota (frame timeout indefinido) pero WiFi/link estables.
#   - RX_NONE: crash fatal en cada boot — "SDIO mode mismatch: slave is
#     in streaming mode, but host is in packet mode. Aborting."
#   - RX_MAX_SIZE: MISMO crash fatal, identico mensaje.
# Cualquier opcion distinta de la default hace que el host se anuncie
# como "packet" en la negociacion — y el C6 nunca puede aceptar eso
# porque esta version vendorizada de esp_hosted (3.0.7) tiene el modo
# PACKET del lado CP deshabilitado upstream (ver
# coprocessor/sdkconfig.defaults, "#error Not the current run" en
# coprocessor/eh_cp_transport/src/eh_cp_transport_sdio.c:378). Conclusion:
# este Kconfig choice no es un camino viable para probar la hipotesis
# SW_AGGR con este firmware del C6 — hace falta otro enfoque (ver memoria
# project-wifi-companion-app). Se vuelve al default explicitamente para
# dejar la placa en el estado estable conocido.
CONFIG_ESP_HOSTED_HOST_SDIO_RX_STREAMING_MODE=y

CONFIG_ESP_HOSTED_HOST_FEAT_RPC=y
CONFIG_ESP_HOSTED_HOST_FEAT_RPC_EXT_V2=y
CONFIG_ESP_HOSTED_HOST_FEAT_SYSTEM=y
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI=y
